- Setting how='outer' allows us to include everything present in both tables.
- Recall we match Andrew and Bob in both tables

<img src="./assets/11/1-merge_1.png" width="600px" />
<br><br>
- We can use how='outer' to make sure we rab all names from both tables.
<img src="./assets/11/1-merge_2.png" width="600px" />
<br><br>
- pd.merge(registrations, logins, how='outer', on='name')
<img src="./assets/11/1-merge_3.png" width="600px" />
<img src="./assets/11/1-merge_4.png" width="600px" />

In [10]:
import pandas as pd
import numpy as np

In [11]:
registrations = pd.DataFrame({'reg_id': [1, 2, 3, 4], 'name': ['Andrew', 'BoBo','Claire','David']})
logins = pd.DataFrame({'log_id': [1, 2, 3, 4], 'name': ['Xavier', 'Andrew','Yolanda','BoBo']})

In [12]:
registrations

   reg_id    name
0       1  Andrew
1       2    BoBo
2       3  Claire
3       4   David

In [13]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     BoBo

In [14]:
# outer join
pd.merge(registrations, logins, how='outer', on='name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     BoBo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [15]:
# the tables order DOES MATTER
pd.merge(logins, registrations, how='outer', on='name')

   log_id     name  reg_id
0     1.0   Xavier     NaN
1     2.0   Andrew     1.0
2     3.0  Yolanda     NaN
3     4.0     BoBo     2.0
4     NaN   Claire     3.0
5     NaN    David     4.0

In [16]:
# make the names col as the index
registrations = registrations.set_index('name')

In [17]:
registrations

        reg_id
name
Andrew       1
BoBo         2
Claire       3
David        4

In [18]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     BoBo